In [46]:
import pandas as pd 
import numpy as np

#   DataFrame

From dict of Series or dicts

In [48]:
d = {
    "one" : pd.Series([1,2,3],index= ['a','b','c']),
    "two" : pd.Series([4,5,6],index= ['a','b','c']),
}
d

{'one': a    1
 b    2
 c    3
 dtype: int64,
 'two': a    4
 b    5
 c    6
 dtype: int64}

In [50]:
data = pd.DataFrame(d)
data

   one  two
a    1    4
b    2    5
c    3    6

To find the values in DF

In [51]:
data.values

array([[1, 4],
       [2, 5],
       [3, 6]])

To find the index in the DataFrame

In [52]:
data.index

Index(['a', 'b', 'c'], dtype='object')

To find Columns

In [53]:
data.columns

Index(['one', 'two'], dtype='object')

From a list of dicts

In [17]:
data2 = [{'a': 1 , 'b':2}, {'c': 3, 'd': 4}]

In [54]:
data2

[{'a': 1, 'b': 2}, {'c': 3, 'd': 4}]

In [55]:
DF = pd.DataFrame(data2)
DF

     a    b    c    d
0  1.0  2.0  NaN  NaN
1  NaN  NaN  3.0  4.0

TO update the index value

In [26]:
b = pd.DataFrame(data2, index=["first", "second"])
b

          a    b    c    d
first   1.0  2.0  NaN  NaN
second  NaN  NaN  3.0  4.0

To change the column value

In [24]:
a   =  pd.DataFrame(data2, columns = [1,2,3,4])
a

    1   2   3   4
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN

From a dict of tuples

In [ ]:
a  = pd.DataFrame(
    {
        ("a", "b"): {("A", "B"): 1, ("A", "C"): 2},
        ("a", "a"): {("A", "C"): 3, ("A", "B"): 4},
        ("a", "c"): {("A", "B"): 5, ("A", "C"): 6},
        ("b", "a"): {("A", "C"): 7, ("A", "B"): 8},
        ("b", "b"): {("A", "D"): 9, ("A", "B"): 10},
    }
)
a

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

In [32]:
data3 = pd.DataFrame(a)
data3

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

Column selection, addition, deletion

In [56]:
d = {
    "A" : pd.Series([1, 2, 3], index=["a", "b", "c"]),
    "B" : pd.Series([4, 5, 6], index=["a", "b", "c"]),
}

In [57]:
d

{'A': a    1
 b    2
 c    3
 dtype: int64,
 'B': a    4
 b    5
 c    6
 dtype: int64}

In [58]:
dataframe = pd.DataFrame(d)
dataframe

   A  B
a  1  4
b  2  5
c  3  6

In [59]:
dataframe['A']

a    1
b    2
c    3
Name: A, dtype: int64

In [60]:
dataframe['B']

a    4
b    5
c    6
Name: B, dtype: int64

In [61]:
dataframe['C'] = dataframe['A'] * dataframe['B']
dataframe

   A  B   C
a  1  4   4
b  2  5  10
c  3  6  18

Columns can be deleted or popped like with a dict

In [62]:
del dataframe['C']

In [63]:
dataframe

   A  B
a  1  4
b  2  5
c  3  6